Documents/ЗаписиУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ЗаписиУСН</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПримененныеВычетыПоНДФЛ</xr:Item>
				<xr:Item>AccumulationRegister.КнигаУчетаДоходовИРасходов</xr:Item>
				<xr:Item>AccumulationRegister.НДФЛДоходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗаписей</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗаписейФормированийКУДиР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>999</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеОЗачетеВСчетПредстоящейОбязанности</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеМесяца</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоЕдиномуНалоговомуСчету</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОбИсчисленныхСуммахНалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗаписиКУДиР</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоходВсего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоходБаза</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходВсего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходБаза</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервичныйДокумент</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СписаниеЗапасов</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаписиУСН</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
								<v8:Type>cfg:DocumentRef.ПеремещениеЗапасов</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
								<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходСоСчета</v8:Type>
								<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеВКассу</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
								<v8:Type>cfg:DocumentRef.СборкаЗапасов</v8:Type>
								<v8:Type>cfg:DocumentRef.РаспределениеЗатрат</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходИзКассы</v8:Type>
								<v8:Type>cfg:DocumentRef.Взаимозачет</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеНаСчет</v8:Type>
								<v8:Type>cfg:DocumentRef.УведомлениеОбИсчисленныхСуммахНалогов</v8:Type>
								<v8:Type>cfg:DocumentRef.ДополнительныеРасходы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПервичногоДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПервичногоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВзносыПодлежащиеУплате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидВзносаПодлежащегоУплате</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыФиксированныхВзносовПодлежащихУплате</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГрафикПоОС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПериодПризнания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВнеоборотныеАктивы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СистемыНалогообложенияОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СистемыНалогообложенияОрганизаций</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СистемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикЕНВД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяПатент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикТорговыйСбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РозничнаяПродажаАлкоголя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышеннаяСтавкаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяАУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикЕНП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикНДСПрименяющийУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЮридическоеФизическоеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ЮридическоеФизическоеЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СистемыНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СистемыНалогообложения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Общая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Упрощенная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсобыйПорядок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АУСН</Name>
					<Comment>Автоматизированная УСН</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОбъектовНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыОбъектовНалогообложения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыМинусРасходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаписиУСН/Forms/ФормаСпискаЗаписиПрочие/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ДанныеВыбораПериодаИзВыпадающегоСписка;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Организация) Тогда
		Организация = Параметры.Организация;
	Иначе
		Организация = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(), "ОсновнаяОрганизация");
		Если Не ЗначениеЗаполнено(Организация) Тогда
			Организация = Справочники.Организации.ПредопределеннаяОрганизация();
		КонецЕсли;
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	Заголовок = Заголовок + ?(ПустаяСтрока(Заголовок),"",": ") + НСтр("ru='Записи Книги учета доходов и расходов'");
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(КУДиР, "Организация", Организация, , ,
		ЗначениеЗаполнено(Организация));
	
	ВидПериода  = Перечисления.ДоступныеПериодыОтчета.Год;
	ОтборПериодЗначение.ДатаНачала = НачалоГода(ТекущаяДатаСеанса());
	ОтборПериодЗначение.ДатаОкончания  = КонецГода(ОтборПериодЗначение.ДатаНачала);
	
	ОтборПериодИспользование = Истина;
	ОтборПериод = ОтчетыУНФКлиентСервер.ПредставлениеСтандартногоПериода(ОтборПериодЗначение, ВидПериода);
	УстановитьОтборПоПериоду(ЭтаФорма, ОтборПериодЗначение.ДатаНачала, ОтборПериодЗначение.ДатаОкончания, ОтборПериодИспользование);

	РегистрУчетаПоПартиям = УчетПартийУСН.ТекущийРегистрУчетаПартийТоваров();
	Если РегистрУчетаПоПартиям = УчетПартийУСН.РегистрыУчетаПартийТоваров().ПартииТоваров Тогда
		КлючиНастройки = КлючиНастройкиПредупреждениеСменыПартий();
		ТребуетсяПереключитьУчетПартий = НЕ ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(КлючиНастройки.КлючОбъекта,
			КлючиНастройки.КлючНастроек, Ложь);
	КонецЕсли;
	
	ВариантОтчетаПоТоварам = Справочники.ВариантыОтчетов.НайтиПоНаименованию("Анализ расходов на товары");
	
	НастроитьВидимостьИДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьКнопкиУдалить();
	
	Если ТребуетсяПереключитьУчетПартий Тогда
		ПоказатьПредложениеСменыУчетаПартий(Истина);
	Иначе
		ПодключитьОбработчикОжидания("ЗапуститьОбновлениеЗаписейПриОткрытии", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "УдаленаЗаписьКУДИР" Тогда
		ОповеститьОбИзменении(Тип("РегистрНакопленияКлючЗаписи.КнигаУчетаДоходовИРасходов"));
	ИначеЕсли ИмяСобытия = "ИзмененыНастройкиФормированияКУДиР" Тогда
		ОбновитьЗаписи(Параметр);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(КУДиР, "Организация", Организация, , ,
		ЗначениеЗаполнено(Организация));
	НастроитьВидимостьИДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПериодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НачалоПериода = ОтборПериодЗначение.ДатаНачала;
	Если НачалоПериода = '00010101' Тогда
		НачалоПериода = ОтчетыУНФКлиентСервер.НачалоПериодаОтчета(ВидПериода, ОбщегоНазначенияКлиент.ДатаСеанса());
	КонецЕсли;
	
	// Параметры для чтения из обработчиков:
	ПараметрыВыбора = Новый Структура;
	// Для выбора значения:
	ПараметрыВыбора.Вставить("Значение",               ОтборПериодЗначение);
	ПараметрыВыбора.Вставить("Элемент",                Элемент);
	// Для загрузки значения:
	ПараметрыВыбора.Вставить("ВидПериода",             ВидПериода);
	
	ВыборПериодаИзВыпадающегоСписка(-1, ПараметрыВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПериодОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	УстановитьОтборПоПериоду(ЭтаФорма, ОтборПериодЗначение.ДатаНачала, ОтборПериодЗначение.ДатаОкончания, ОтборПериодИспользование);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПериодИспользованиеПриИзменении(Элемент)
	УстановитьОтборПоПериоду(ЭтаФорма, ОтборПериодЗначение.ДатаНачала, ОтборПериодЗначение.ДатаОкончания, ОтборПериодИспользование);
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСДатыЗавершение(Период, ДополнительныеДанные) Экспорт
	
	ОбновитьЗаписи(Период);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияУстановитьСдаватьОтчетностьНажатие(Элемент)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Ключ", Организация);
	ПараметрыОткрытия.Вставить("УстановитьТекущийЭлемент", "ИспользуетсяОтчетность");
	
	ОткрытьФорму("Справочник.Организации.ФормаОбъекта", ПараметрыОткрытия);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКУДиР

&НаКлиенте
Процедура КУДиРВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ Тип("ДокументСсылка.ЗакрытиеМесяца") = ТипЗнч(Элементы.КУДиР.ТекущиеДанные.Регистратор) Тогда
		ПараметрыФормы = Новый Структура(
		"Ключ, НомерСтроки",
		Элементы.КУДиР.ТекущиеДанные.Регистратор,
		Элементы.КУДиР.ТекущиеДанные.НомерСтрокиДокумента);
		
		ОткрытьФорму("Документ.ЗаписиУСН.Форма.ФормаЗаписиКУДИР",ПараметрыФормы,Элементы.КУДиР);
	Иначе  
		СтруктураОткрытия = Новый Структура;
		СтруктураОткрытия.Вставить("Месяц", Элементы.КУДиР.ТекущиеДанные.ДатаПервичногоДокумента);
		СтруктураОткрытия.Вставить("Организация", Организация);
		ОткрытьФорму("Обработка.ЗакрытиеМесяца.Форма", СтруктураОткрытия);
    КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КУДиРПриАктивизацииСтроки(Элемент)
	
	УстановитьДоступностьКнопкиУдалить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьРучнуюЗаписьУСН(Команда)
	ОткрытьФорму("Документ.ЗаписиУСН.Форма.ФормаЗаписиКУДИР",Новый Структура("ДокументыЗаПериод, Организация", ДокументыЗаПериод, Организация),Элементы.КУДиР);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗапись(Команда)
	
	ТекущиеДанные = Элементы.КУДиР.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;  

	УдалитьЗаписьСервер(ТекущиеДанные.Регистратор,
		ТекущиеДанные.НомерСтрокиДокумента);
	ОбновитьИнтерфейс();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКУДИР(Команда)
	
	ЗапуститьОбновлениеЗаписей();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОбновлениеЗаписей(Команда)
	
	Если ФоновоеЗаданиеЗадачЗапущено Тогда
		ОтменитьОбновлениеЗаписейНаСервере(ФоновоеЗаданиеЗадачИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ОтборПериодИспользование Тогда
		ДатаФормирования = ОтборПериодЗначение.ДатаОкончания;
	Иначе
		ДатаФормирования = ОбщегоНазначенияКлиент.ДатаСеанса();
	КонецЕсли;
	
	ПараметрыОтчета = Новый Структура("Организация, НачалоПериода, КонецПериода",
		Организация,
		НачалоГода(ДатаФормирования),
		КонецГода(ДатаФормирования));
	
	ОткрытьФорму("Отчет.КнигаУчетаДоходовИРасходов.Форма", ПараметрыОтчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСДаты(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПересчитатьСДатыЗавершение", ЭтаФорма);
	ПоказатьВводДаты(Оповещение, ОбщегоНазначенияКлиент.ДатаСеанса(), НСтр("ru = 'Пересчитать с даты'"), ЧастиДаты.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСпособРасчетаПартий(Команда)
	
	ПоказатьПредложениеСменыУчетаПартий(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоТоварам(Команда)

	Если Не ЗначениеЗаполнено(ВариантОтчетаПоТоварам) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СформироватьПриОткрытии", Истина);
	
	ОтборРасшифровки = Новый Структура;
	Если ЗначениеЗаполнено(Организация) Тогда
		ОтборРасшифровки.Вставить("Организация", Организация);
	КонецЕсли;
	Если ОтборПериодИспользование Тогда
		ОтборРасшифровки.Вставить("Период", ОтборПериодЗначение);
	КонецЕсли;
	Если ОтборРасшифровки.Количество() > 0 Тогда
		ПараметрыОткрытия.Вставить("Отбор", ОтборРасшифровки);
	КонецЕсли;
	
	ВариантыОтчетовКлиент.ОткрытьФормуОтчета(ЭтотОбъект, ВариантОтчетаПоТоварам, ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиУчета(Команда)
	ПараметрыНастроек = Новый Структура("Период", ОтборПериодЗначение.ДатаОкончания);
	ОткрытьФорму("РегистрСведений.НастройкиУчетаУСН.Форма.НастройкаУчетаУСН", ПараметрыНастроек, ЭтотОбъект, , , , ,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьВидимостьИДоступность()
	
	ВидимостьГруппыИспользуетсяОтчетность = Ложь;
	ВидимостьЭтоЮридическоеЛицо = Ложь;
	ДоступныЗаписиКУДиР = НЕ Организация.Пустая();
	
	Если Не Организация.Пустая() Тогда
		ЗначенияРеквизитовСтруктура = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "ИспользуетсяОтчетность, ЮридическоеФизическоеЛицо");
		Если ЗначенияРеквизитовСтруктура.ЮридическоеФизическоеЛицо = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо") Тогда
			ВидимостьЭтоЮридическоеЛицо = Истина;
			ДоступныЗаписиКУДиР = Ложь;
		ИначеЕсли Не ЗначенияРеквизитовСтруктура.ИспользуетсяОтчетность Тогда
			ВидимостьГруппыИспользуетсяОтчетность = Истина;
			ДоступныЗаписиКУДиР = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ДекорацияЭтоЮридическоеЛицо.Видимость = ВидимостьЭтоЮридическоеЛицо;
	Элементы.ГруппаИспользуетсяОтчетность.Видимость = ВидимостьГруппыИспользуетсяОтчетность;
	Элементы.КУДиРИзменитьСпособРасчетаПартий.Видимость = ДоступныЗаписиКУДиР;
	
	ВключенУчетПоПартиямУСН = ВключенУчетПоПартиямУСН();
	НастройкиНалогообложения = РегистрыСведений.СистемыНалогообложенияОрганизаций.ПолучитьПоследнее(
		Мин(ТекущаяДатаСеанса(), ОтборПериодЗначение.ДатаОкончания),
		Новый Структура("Организация", Организация));
	
	Элементы.ОтчетАнализРасходовНаТовары.Видимость = ДоступныЗаписиКУДиР И ВключенУчетПоПартиямУСН
		И НастройкиНалогообложения.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная
		И НастройкиНалогообложения.ОбъектНалогообложения = Перечисления.ВидыОбъектовНалогообложения.ДоходыМинусРасходы;

	Элементы.ГруппаПереключениеУчетаПартий.Видимость = ДоступныЗаписиКУДиР И НЕ ВключенУчетПоПартиямУСН;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЗаписьСервер(Знач Документ, Знач НомерСтроки)
	
	Если Документ <> Неопределено Тогда
		Объект = Документ.ПолучитьОбъект();
		РабочаяСтрока = Объект.ЗаписиКУДиР[НомерСтроки-1];
		Объект.ЗаписиКУДиР.Удалить(РабочаяСтрока);
		Объект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКнопкиУдалить()
	
	Элементы.ФормаУдалитьЗапись.Доступность = (Элементы.КУДиР.ТекущиеДанные <> Неопределено)
	И НЕ Тип("ДокументСсылка.ЗакрытиеМесяца") = ТипЗнч(Элементы.КУДиР.ТекущиеДанные.Регистратор);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	// СписокЗадачОрганизация
	ЭлементУО = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента 		= ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле 	= Новый ПолеКомпоновкиДанных("КУДиРОрганизация");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Организация", ВидСравненияКомпоновкиДанных.НеРавно, Справочники.Организации.ПустаяСсылка());

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПредложениеСменыУчетаПартий(ЭтоОткрытиеФормы)
	
	ДанныеПредложения = Новый Структура;
	ДанныеПредложения.Вставить("ВызваноПриОткрытии", ЭтоОткрытиеФормы);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗакрытоПредложениеСменыУчетаПартий", ЭтотОбъект);
	ОткрытьФорму("Документ.ЗаписиУСН.Форма.ФормаПереключениеПартий", ДанныеПредложения, ЭтотОбъект, , , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытоПредложениеСменыУчетаПартий(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.ИзмененРегистрПартий Тогда
		ЗапуститьОбновлениеЗаписей();
		НастроитьВидимостьИДоступность();
	КонецЕсли;
	
	Если Результат.ОтключитьПредупреждение Тогда
		КлючиНастройки = КлючиНастройкиПредупреждениеСменыПартий();
		ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить(КлючиНастройки.КлючОбъекта,
			КлючиНастройки.КлючНастроек, Истина);
	КонецЕсли;
	
КонецПроцедуры

#Область ОбновлениеЗаписейВФоне

&НаКлиенте
Процедура ОбновитьЗаписи(Период)

	Если Период = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьДатуГраницыФормирования(Период);
	
	СписокЗаписейАктуален = Ложь;
	ЗапуститьОбновлениеЗаписей(Период);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ЗапуститьОбновлениеЗаписейПриОткрытии()
	ЗапуститьОбновлениеЗаписей();
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОбновлениеЗаписей(Период = Неопределено)
	
	СписокЗаписейАктуален = Ложь;
	
	РезультатЗапуска = ЗапуститьОбновлениеДанныхНаСервере(Период);
	Если НЕ РезультатЗапуска.ОбновлениеДанныхЗапущено Тогда
		Если ЗначениеЗаполнено(Период) Тогда
			ТекстСообщения = НСтр("ru = 'В данный момент выполняется обновление записей КУДиР. Повторите позже.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = РезультатЗапуска.ДлительнаяОперация;
	ФоновоеЗаданиеЗадачИдентификатор = ДлительнаяОперация.ИдентификаторЗадания;
	
	Если ДлительнаяОперация.Статус = "Выполняется" Тогда
		
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаОжидание;
		ФоновоеЗаданиеЗадачЗапущено = Истина;
		
		ОповещениеПрогресс = Новый ОписаниеОповещения("ОбновляютсяЗаписиКУДиР", ЭтотОбъект);
		ОповещениеЗавершение = Новый ОписаниеОповещения("ОбновленыЗаписиКУДиР", ЭтотОбъект);
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		ПараметрыОжидания.ОповещениеОПрогрессеВыполнения = ОповещениеПрогресс;
		ПараметрыОжидания.ОтменятьПриЗакрытииФормыВладельца = Истина;
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеЗавершение, ПараметрыОжидания); 
	Иначе
		ОбновленыЗаписиКУДиР(ДлительнаяОперация, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновляютсяЗаписиКУДиР(СостояниеДлительнойОперации, ДополнительныеПараметры) Экспорт
	
	Если СостояниеДлительнойОперации = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СостояниеДлительнойОперации.Статус <> "Выполняется" ИЛИ СостояниеДлительнойОперации.Прогресс = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИнформацияОХодеОбновленияЗаписей = СостояниеДлительнойОперации.Прогресс.Текст;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновленыЗаписиКУДиР(Результат, Параметры) Экспорт
	
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаКУДиР;
	ФоновоеЗаданиеЗадачЗапущено	= Ложь;
	
    Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	 
	Если Результат.Статус = "Выполнено" Тогда
		СписокЗаписейАктуален = Истина;
		ОповеститьОбИзменении(Тип("РегистрНакопленияКлючЗаписи.КнигаУчетаДоходовИРасходов"));
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗапуститьОбновлениеДанныхНаСервере(Знач Период = Неопределено)
	
	Результат = Новый Структура("ОбновлениеДанныхЗапущено, ДлительнаяОперация", Ложь);
	
	Если МонопольныйРежим() Тогда
		Возврат Результат;
	КонецЕсли;
	
	ПараметрыФункции = Новый Структура(); 
	
	// заданный период перерасчета больше конца текущего квартала
	Если Период <> Неопределено И Период > КонецКвартала(ТекущаяДатаСеанса())Тогда
		ПараметрыФункции.Вставить("ДатаФормирования", КонецКвартала(Период));
	// выбран будущий период в шапке	
	ИначеЕсли КонецКвартала(ТекущаяДатаСеанса())< ОтборПериодЗначение.ДатаНачала Тогда
		ПараметрыФункции.Вставить("ДатаФормирования", КонецКвартала(ОтборПериодЗначение.ДатаНачала));
	Иначе	
		ПараметрыФункции.Вставить("ДатаФормирования", КонецКвартала(ТекущаяДатаСеанса()));
	КонецЕсли;
	
	НаименованиеЗадания = НСтр("ru = 'Обновление списка записей КУДиР'");
	ИмяПроцедуры = "РегламентированнаяОтчетностьУСН.ВыполнитьФормированияВсехЗаписейКУДИР_ФоновоеЗадание";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	Результат.ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(ИмяПроцедуры, ПараметрыФункции, ПараметрыВыполнения);
	Результат.ОбновлениеДанныхЗапущено = Истина;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОтменитьОбновлениеЗаписейНаСервере(Знач ИдентификаторЗадания)
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	
КонецПроцедуры

#КонецОбласти

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборПоПериоду(Форма, НачалоПериода, КонецПериода, Использование)
	
	ОтборКомпоновкиДанных = Форма.КУДиР.КомпоновщикНастроек.Настройки.Отбор;
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(
		ОтборКомпоновкиДанных, "ГодДокумента");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ОтборКомпоновкиДанных, "ГодДокумента", Год(НачалоПериода), ВидСравненияКомпоновкиДанных.Равно, "ДатаПервичногоДокументаНачало", Использование);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаИзВыпадающегоСписка(Результат, ПараметрыВыбора) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат; // Отмена выбора.
	КонецЕсли;
	
	Если Результат = -1 Тогда // Начало выбора.
		// Чтение параметров для формирования списка из сохраненного значения периода.
		ПараметрыВыбора.Вставить("НачалоПериода", ПараметрыВыбора.Значение.ДатаНачала);
		ПараметрыВыбора.Вставить("Вариант",       ПараметрыВыбора.Значение.Вариант);
		ИндексНачальногоЗначения = Неопределено;
	ИначеЕсли ТипЗнч(Результат.Значение) = Тип("Структура") Тогда
		// Чтение параметров для формирования списка из выбранного значения.
		ПараметрыВыбора.Вставить("НачалоПериода", Результат.Значение.НачалоПериода);
		ПараметрыВыбора.Вставить("Вариант",       Результат.Значение.Вариант);
		ИндексНачальногоЗначения = Результат.Значение.ИндексНачальногоЗначения;
	Иначе
		// Загрузка результата выбора.
		ЗагрузитьРезультатВыбораПериодаИзВыпадающегоСписка(Результат, ПараметрыВыбора);
		Возврат;
	КонецЕсли;
	
	// Формирование списка выбора.
	Если ПараметрыВыбора.Вариант = Неопределено Или ПараметрыВыбора.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод Тогда
		
		СписокПериодов = ОтчетыУНФКлиентСервер.СписокФиксированныхПериодов(ПараметрыВыбора.НачалоПериода, ПараметрыВыбора.ВидПериода);
		
		Если ИндексНачальногоЗначения = Неопределено Тогда
			ИндексНачальногоЗначения = СписокПериодов.НайтиПоЗначению(ПараметрыВыбора.НачалоПериода);
		КонецЕсли;
		
		ОписаниеНавигационногоЭлемента = Новый Структура;
		ОписаниеНавигационногоЭлемента.Вставить("НачалоПериода",            СписокПериодов[0].Значение);
		ОписаниеНавигационногоЭлемента.Вставить("Вариант",                  Неопределено);
		ОписаниеНавигационногоЭлемента.Вставить("ИндексНачальногоЗначения", 0);
		СписокПериодов[0].Значение = ОписаниеНавигационногоЭлемента;
		
		ОписаниеНавигационногоЭлемента = Новый Структура;
		ОписаниеНавигационногоЭлемента.Вставить("НачалоПериода",            СписокПериодов[8].Значение);
		ОписаниеНавигационногоЭлемента.Вставить("Вариант",                  Неопределено);
		ОписаниеНавигационногоЭлемента.Вставить("ИндексНачальногоЗначения", 8);
		СписокПериодов[8].Значение = ОписаниеНавигационногоЭлемента;
		
		Если Не ПараметрыВыбора.Свойство("ВариантСтандартногоПериодаПоВиду") Тогда
			ПараметрыВыбора.Вставить("ВариантСтандартногоПериодаПоВиду", ОтчетыУНФКлиентСервер.ПривестиВидПериодаКСтандартному(ПараметрыВыбора.ВидПериода));
		КонецЕсли;
		
		
	Иначе
		
		СписокПериодов = ОтчетыУНФКлиентСервер.СписокВычисляемыхПериодов(ПараметрыВыбора.ВидПериода);
		
		Если ИндексНачальногоЗначения = Неопределено Тогда
			ИндексНачальногоЗначения = СписокПериодов.НайтиПоЗначению(ПараметрыВыбора.Вариант);
		КонецЕсли;
		
		ОписаниеНавигационногоЭлемента = Новый Структура;
		ОписаниеНавигационногоЭлемента.Вставить("НачалоПериода",            ПараметрыВыбора.НачалоПериода);
		ОписаниеНавигационногоЭлемента.Вставить("Вариант",                  Неопределено);
		ОписаниеНавигационногоЭлемента.Вставить("ИндексНачальногоЗначения", Неопределено);
		СписокПериодов.Добавить(ОписаниеНавигационногоЭлемента, НСтр("ru = 'Фиксированный...'"));
		
	КонецЕсли;
	
	Если ИндексНачальногоЗначения = Неопределено Тогда
		ИндексНачальногоЗначения = СписокПериодов.Количество() - 1;
	КонецЕсли;
	
	ДанныеВыбораПериодаИзВыпадающегоСписка = Новый Структура;
	ДанныеВыбораПериодаИзВыпадающегоСписка.Вставить("ПараметрыВыбора", ПараметрыВыбора);
	ДанныеВыбораПериодаИзВыпадающегоСписка.Вставить("СписокПериодов", СписокПериодов);
	ДанныеВыбораПериодаИзВыпадающегоСписка.Вставить("ИндексНачальногоЗначения", ИндексНачальногоЗначения);
	Если Результат = -1 Тогда
		НачатьВыборПериодаИзВыпадающегоСписка();
	Иначе
		ПодключитьОбработчикОжидания("НачатьВыборПериодаИзВыпадающегоСписка", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВыборПериодаИзВыпадающегоСписка()
	
	Если ДанныеВыбораПериодаИзВыпадающегоСписка.Свойство("ПараметрыВыбора") Тогда
		Контекст = ДанныеВыбораПериодаИзВыпадающегоСписка;
		ДанныеВыбораПериодаИзВыпадающегоСписка = Новый Структура;
		Обработчик = Новый ОписаниеОповещения("ВыборПериодаИзВыпадающегоСписка", ЭтотОбъект, Контекст.ПараметрыВыбора);
		ПоказатьВыборИзСписка(Обработчик, Контекст.СписокПериодов, Контекст.ПараметрыВыбора.Элемент, Контекст.ИндексНачальногоЗначения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьРезультатВыбораПериодаИзВыпадающегоСписка(Результат, ПараметрыВыбора)
	
	Значение = ПараметрыВыбора.Значение;
	
	// Запись результата выбора в данные формы и пользовательские настройки КД.
	Если ТипЗнч(Результат.Значение) = Тип("ВариантСтандартногоПериода") Тогда
		ОтборПериод = ?(ПустаяСтрока(Результат.Представление), Строка(Результат.Значение), Результат.Представление);
		Значение.Вариант = Результат.Значение;
	Иначе
		ОтборПериодЗначение.ДатаНачала = ОтчетыУНФКлиентСервер.НачалоПериодаОтчета(ПараметрыВыбора.ВидПериода, Результат.Значение);
		ОтборПериодЗначение.ДатаОкончания  = ОтчетыУНФКлиентСервер.КонецПериодаОтчета(ПараметрыВыбора.ВидПериода, Результат.Значение);
		
		ОтборПериод = Результат.Представление;
		
		Значение.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
		Значение.ДатаНачала    = ОтборПериодЗначение.ДатаНачала;
		Значение.ДатаОкончания = ОтборПериодЗначение.ДатаОкончания;
	КонецЕсли;
	
	ОтборПериодЗначение = Значение;
	УстановитьОтборПоПериоду(ЭтаФорма, ОтборПериодЗначение.ДатаНачала, ОтборПериодЗначение.ДатаОкончания, ОтборПериодИспользование);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьДатуГраницыФормирования(Знач Период)
	ДатаГраницыФормирования = РегламентированнаяОтчетностьУСН.ПолучитьДатуНачалаФормированияЗаписейКУДиР();
	Если Период < ДатаГраницыФормирования Тогда
		РегламентированнаяОтчетностьУСН.УстановитьДатуНачалаФормированияЗаписейКУДиР(Период);
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция КлючиНастройкиПредупреждениеСменыПартий()
	
	Результат = Новый Структура;
	Результат.Вставить("КлючОбъекта", "ЗаписиУСН");
	Результат.Вставить("КлючНастроек", "ПредложениеИзмененияУчетаПартийСкрыто");
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ВключенУчетПоПартиямУСН()
	
	Возврат УчетПартийУСН.ТекущийРегистрУчетаПартийТоваров() = УчетПартийУСН.РегистрыУчетаПартийТоваров().ПартииТоваровУСН;
	
КонецФункции

#КонецОбласти
